app/views/people/_person_support_fields.html.erb

SELECT `support_services`.* FROM `support_services` ORDER BY name
---
        <p> Support Service </p>
        <%= g.collection_select :support_service_id, SupportService.all.order('name'), :id, :name %>