app/views/people/_person_school_fields.html.erb

SELECT `schools`.* FROM `schools` ORDER BY name
---
    <!-- fields -->
    <%= f.input :school_id, :collection => School.all.order('name') %>