app/views/people/_person_allergy_fields.html.erb

    <!-- fields -->
    <%= f.input :allergy_id, :collection => Allergy.all.order('name') %>
---
SELECT `allergies`.* FROM `allergies` ORDER BY name