app/views/people/_person_medication_fields.html.erb

SELECT `medications`.* FROM `medications` ORDER BY name
---
        <p> Allergy </p>
        <%= g.collection_select :medication_id, Medication.all.order('name'), :id, :name %>