app/views/people/index.html.erb

          <p> School Name </p>
          <p> <%= select_tag :school, options_from_collection_for_select(School.all, "id", "name"), :include_blank => true %> </p>
---
SELECT `schools`.* FROM `schools`

          <p> Allergy </p>
          <p><%= select_tag :allergy, options_from_collection_for_select(Allergy.all, "id", "name"), :include_blank => true %></p>
---
SELECT `allergies`.* FROM `allergies`

          <p> Medication </p>
          <p> <%= select_tag :medication, options_from_collection_for_select(Medication.all, "id", "name"), :include_blank => true %> </p>
---
SELECT `medications`.* FROM `medications`

          <p> Support Services </p>
          <p> <%= select_tag :support_service, options_from_collection_for_select(SupportService.all, "id", "name"), :include_blank => true %> </p>
---
SELECT `support_services`.* FROM `support_services`