app/views/program_locations/_form.html.erb

  <div> Program
    <%= f.collection_select(:program_id, Program.all, :id, :name) %>
---
SELECT `programs`.* FROM `programs`