app/views/programs/_program_locations.html.erb

<% @programs.each do|program| %>
<% if program.program_locations.empty? %>
---
SELECT `program_locations`.* FROM `program_locations` WHERE `program_locations`.`program_id` = 2