app/views/events/by_person.html.erb

		<tbody>
			<% person.events.each do |event| %>
---
SELECT `events`.* FROM `events` INNER JOIN `person_events` ON `events`.`id` = `person_events`.`event_id` WHERE `person_events`.`person_id` = 2