app/views/events/show.html.erb

SELECT 1 AS one FROM `event_employees` WHERE `event_employees`.`event_id` = 3 LIMIT 1
SELECT `event_employees`.* FROM `event_employees` WHERE `event_employees`.`event_id` = 3
---
<!--
 <% if @event.event_employees.empty? %>

SELECT `person_events`.* FROM `person_events` WHERE `person_events`.`event_id` = 1
---
    <tbody>
      <% @event.person_events.each do |person_event| %>