app/controllers/events_controller.rb

  def edit_attendees
    delete_list = params[:remove_ids]
    if(delete_list != nil)
      delete_list.each do |i|
        pe = PersonEvent.find(i)
        pe.destroy
      end

    end

    pes = params[:person_events]
    if(pes != nil)
      pes.keys.each do |pe|
        this_pe = PersonEvent.find_by_id(pe)
        if(this_pe  != nil)
          this_pe.contacted = params[:person_events][pe][:contacted]
          this_pe.responded = params[:person_events][pe][:responded]
          this_pe.attending = params[:person_events][pe][:attending]
          this_pe.paid = params[:person_events][pe][:paid]
          this_pe.attended = params[:person_events][pe][:attended]
          this_pe.notes = params[:person_events][pe][:notes]
          this_pe.save
---
SELECT `person_events`.* FROM `person_events` WHERE `person_events`.`id` = 4 LIMIT 1
UPDATE `person_events` SET `contacted` = 1, `updated_at` = '2013-07-19 05:17:01' WHERE `person_events`.`id` = 12

  def mailing
    @arr = params[:people]
    if(@arr != nil && @arr.any?)
      @personevents = PersonEvent.find(@arr)
---
SELECT `people`.* FROM `people` WHERE `people`.`id` = 1 ORDER BY `people`.`id` ASC LIMIT 1
SELECT `person_events`.* FROM `person_events` WHERE `person_events`.`id` IN (4, 12)

  def mailing_search
    @event = Event.find(params[:id])
    @pes = @event.person_events
    @search = params[:search]
    if(@search[:contacted] != 'all')
      @pes = @pes.where(:contacted => @search[:contacted])
    end
    if(@search[:responded] != 'all')
    @pes = @pes.where(:responded => @search[:responded])
    end
    if(@search[:attending] != 'all')
    @pes = @pes.where(:attending => @search[:attending])
    end
    if(@search[:paid] != 'all')
    @pes = @pes.where(:paid => @search[:paid])
    end
    if(@search[:attended] != 'all')
    @pes = @pes.where(:attended => @search[:attended])
    end
    @arr = Array.new

    @pes.each do |p|
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 3 LIMIT 1
SELECT `person_events`.* FROM `person_events` WHERE `person_events`.`event_id` = 3

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`city`, `comments`, `created_at`, `date`, `kind`, `location`, `name`, `state`, `street_address`, `time`, `updated_at`, `zip_code`) VALUES ('Pittsburgh', 'Present our NLA database demo!', '2013-07-18 21:13:27', '7/19/2013', 'Database Meetings', 'NLA Office', 'Meet with Stephen', 'PA', '5429 Penn Ave.', '2013-07-18 11:30:00', '2013-07-18 21:13:27', 15206)