app/controllers/forms_controller.rb

  def create
    @form = Form.new(form_params)

    respond_to do |format|
      if @form.save
---
INSERT INTO `forms` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-07-24 16:52:01', 'Background check for people working with kids', 'Child Abuse Clearance', '2013-07-24 16:52:01')

    def set_form
      @form = Form.find(params[:id])
---
SELECT `forms`.* FROM `forms` WHERE `forms`.`id` = 1 LIMIT 1