app/controllers/interests_controller.rb

SELECT `interests`.* FROM `interests`
---
  def index
    @interests = Interest.all

DELETE FROM `interests` WHERE `interests`.`id` = 4
---
  def destroy
    @interest.destroy

SELECT `interests`.* FROM `interests` WHERE `interests`.`id` = 4 LIMIT 1
---
    def set_interest
      @interest = Interest.find(params[:id])