app/controllers/people_controller.rb

SELECT `roles`.* FROM `roles` INNER JOIN `person_roles` ON `roles`.`id` = `person_roles`.`role_id` WHERE `person_roles`.`person_id` = 1
---
  def search
    roles_where_string = String.new
    general_info_string = String.new
    student_info_string = String.new
    a = Person.joins(:roles)