app/controllers/program_attendances_controller.rb

INSERT INTO `program_dates` (`created_at`, `date`, `program_location_id`, `updated_at`) VALUES ('2013-07-19 02:11:15', '2013-07-19', 1, '2013-07-19 02:11:15')
SELECT `program_dates`.* FROM `program_dates` WHERE `program_dates`.`program_location_id` = 1 AND `program_dates`.`date` = '2013-7-19' ORDER BY `program_dates`.`id` ASC LIMIT 1
SELECT `program_enrollments`.* FROM `program_enrollments` WHERE `program_enrollments`.`program_location_id` = 1
INSERT INTO `program_attendances` (`created_at`, `program_date_id`, `program_enrollment_id`, `updated_at`) VALUES ('2013-07-19 02:11:15', 10, 1, '2013-07-19 02:11:15')
SELECT `program_attendances`.* FROM `program_attendances` WHERE `program_attendances`.`program_enrollment_id` = 1 AND `program_attendances`.`program_date_id` = 10 ORDER BY `program_attendances`.`id` ASC LIMIT 1
---
  def do
    @location_id = params[:location_id]
    @date = params[:date]
    @day = params[:date][:day]
    @month = params[:date][:month]
    @year = params[:date][:year]
    @program_date = ProgramDate.where(
      program_location_id: @location_id,
      date: @year + '-' + @month + '-' + @day).first_or_create
    @attendances = Array.new

    ProgramEnrollment.where(:program_location_id => @location_id).each do |enrollment|
      @attendances << ProgramAttendance.where(
        program_enrollment_id: enrollment.id,
        program_date_id: @program_date.id).first_or_create