app/controllers/programs_controller.rb

SELECT `programs`.* FROM `programs`
---
  def index
    @programs = Program.all

SELECT `programs`.* FROM `programs` WHERE `programs`.`id` = 2 LIMIT 1
SELECT `program_locations`.* FROM `program_locations` WHERE `program_locations`.`program_id` = 2
---
  def show
    @program = Program.find(params[:id])
    @program_locations = @program.program_locations.all