app/controllers/program_enrollments_controller.rb

  def create
    @program_enrollment = ProgramEnrollment.new(program_enrollment_params)

    respond_to do |format|
      if @program_enrollment.save
---
INSERT INTO `program_enrollments` (`created_at`, `person_id`, `program_location_id`, `updated_at`) VALUES ('2013-07-24 15:55:00', 2, 1, '2013-07-24 15:55:00')

  def destroy
    @program_enrollment.destroy
---
DELETE FROM `program_enrollments` WHERE `program_enrollments`.`id` = 10

    def set_program_enrollment
      @program_enrollment = ProgramEnrollment.find(params[:id])
---
SELECT `program_enrollments`.* FROM `program_enrollments` WHERE `program_enrollments`.`id` = 10 LIMIT 1