app/controllers/program_locations_controller.rb

SELECT `program_locations`.* FROM `program_locations` WHERE `program_locations`.`id` = 1 LIMIT 1
---
  def program_employees
    @program_location = ProgramLocation.find(params[:id])

SELECT `program_locations`.* FROM `program_locations` WHERE `program_locations`.`id` = 2 LIMIT 1
---
  def show
    @program_location = ProgramLocation.find(params[:id])

INSERT INTO `program_locations` (`address`, `created_at`, `name`, `program_id`, `updated_at`) VALUES ('5429 Penn Ave', '2013-07-24 15:54:32', 'NLA/BGC', 1, '2013-07-24 15:54:32')
---
  def create
    @program_location = ProgramLocation.new(program_location_params)

    respond_to do |format|
      if @program_location.save

DELETE FROM `program_locations` WHERE `program_locations`.`id` = 3
---
  def destroy
    @program_location.destroy

SELECT `program_locations`.* FROM `program_locations` WHERE `program_locations`.`id` = 3 LIMIT 1
---
    def set_program_location
      @program_location = ProgramLocation.find(params[:id])