app/controllers/schools_controller.rb

  def index
    @schools = School.all
---
SELECT `schools`.* FROM `schools`

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO `schools` (`address`, `created_at`, `name`, `updated_at`) VALUES ('107 Thackeray St. Pittsburgh, PA 15213', '2013-07-18 20:49:23', 'SciTech', '2013-07-18 20:49:23')

  def destroy
    @school.destroy
---
DELETE FROM `schools` WHERE `schools`.`id` = 1

    def set_school
      @school = School.find(params[:id])
---
SELECT `schools`.* FROM `schools` WHERE `schools`.`id` = 2 LIMIT 1